---
kind: type
id: T:Autodesk.Revit.Attributes.RegenerationOption
source: html/26239bbb-d639-d306-cc43-cc2ec975b822.htm
---
# Autodesk.Revit.Attributes.RegenerationOption

All regeneration options supported by Revit external commands and external applications.

## Syntax (C#)
```csharp
public enum RegenerationOption
```